Revit 2027 API
RebarShapeDefinition.RemoveParameter Method
 Remove the parameter from the definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveParameter(
	ElementId paramId
)
Public Sub RemoveParameter (
	paramId As ElementId
)
public:
void RemoveParameter(
	ElementId^ paramId
)
member RemoveParameter :
        paramId : ElementId -> unit
Parameters
paramId ElementId
 Id of a parameter in the definition.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the definition does not have the parameter, the method does nothing.
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace